XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_cmu.h
#define    CMU_OPCCR1_UART0CKS_Pos                                (0U)
#define    CMU_OPCCR1_UART0CKS_Msk                                (0x3U << CMU_OPCCR1_UART0CKS_Pos)
#define    CMU_OPCCR1_UART0CKS                                    CMU_OPCCR1_UART0CKS_Msk

#define    CMU_OPCCR2_RTCPRSC_Pos                                 (22U)
#define    CMU_OPCCR2_RTCPRSC_Msk                                 (0x3ffU << CMU_OPCCR2_RTCPRSC_Pos)
#define    CMU_OPCCR2_RTCPRSC                                     CMU_OPCCR2_RTCPRSC_Msk

#define    CMU_OPCCR2_RTCCKS_Pos                                  (20U)
#define    CMU_OPCCR2_RTCCKS_Msk                                  (0x1U << CMU_OPCCR2_RTCCKS_Pos)
#define    CMU_OPCCR2_RTCCKS                                      CMU_OPCCR2_RTCCKS_Msk

#define    CMU_OPCCR2_FSCANCKS_Pos                                (16U)
#define    CMU_OPCCR2_FSCANCKS_Msk                                (0x3U << CMU_OPCCR2_FSCANCKS_Pos)
#define    CMU_OPCCR2_FSCANCKS                                     CMU_OPCCR2_FSCANCKS_Msk

#define    CMU_OPCCR2_LEDCKS_Pos                                  (14U)
#define    CMU_OPCCR2_LEDCKS_Msk                                  (0x3U << CMU_OPCCR2_LEDCKS_Pos)
#define    CMU_OPCCR2_LEDCKS                                       CMU_OPCCR2_LEDCKS_Msk

#define    CMU_OPCCR2_RNGPRSC_Pos                                 (10U)
#define    CMU_OPCCR2_RNGPRSC_Msk                                 (0x7U << CMU_OPCCR2_RNGPRSC_Pos)
#define    CMU_OPCCR2_RNGPRSC                                     CMU_OPCCR2_RNGPRSC_Msk

#define    CMU_OPCCR2_LEDPRSC_Pos                                 (5U)
#define    CMU_OPCCR2_LEDPRSC_Msk                                 (0x7U << CMU_OPCCR2_LEDPRSC_Pos)
#define    CMU_OPCCR2_LEDPRSC                                     CMU_OPCCR2_LEDPRSC_Msk

#define    CMU_AHBMCR_MPRIL_Pos                                   (0U)
#define    CMU_AHBMCR_MPRIL_Msk                                   (0x1U << CMU_AHBMCR_MPRIL_Pos)
#define    CMU_AHBMCR_MPRIL                                       CMU_AHBMCR_MPRIL_Msk

#define    FL_CMU_GROUP1_BUSCLK_LPTIM16                           (0x1U << 0U)
#define    FL_CMU_GROUP1_BUSCLK_RTC                               (0x1U << 2U)
#define    FL_CMU_GROUP1_BUSCLK_PMU                               (0x1U << 3U)
#define    FL_CMU_GROUP1_BUSCLK_SCU                               (0x1U << 4U)
#define    FL_CMU_GROUP1_BUSCLK_IWDT                              (0x1U << 5U)
#define    FL_CMU_GROUP1_BUSCLK_ANAC                              (0x1U << 6U)
#define    FL_CMU_GROUP1_BUSCLK_PAD                               (0x1U << 7U)
#define    FL_CMU_GROUP1_BUSCLK_SVD                               (0x1U << 8U)
#define    FL_CMU_GROUP1_BUSCLK_COMP                              (0x1U << 9U)
#define    FL_CMU_GROUP1_BUSCLK_SENT0                             (0x1U << 19U)
#define    FL_CMU_GROUP1_BUSCLK_SENT1                             (0x1U << 20U)
#define    FL_CMU_GROUP1_BUSCLK_LED                               (0x1U << 24U)
#define    FL_CMU_GROUP1_BUSCLK_LCD                               (0x1U << 25U)
#define    FL_CMU_GROUP1_BUSCLK_CLM1                              (0x1U << 26U)
#define    FL_CMU_GROUP1_BUSCLK_CLM0                              (0x1U << 27U)

#define    FL_CMU_GROUP2_BUSCLK_CRC                               (0x1U << 0U)
#define    FL_CMU_GROUP2_BUSCLK_RNG                               (0x1U << 1U)
#define    FL_CMU_GROUP2_BUSCLK_AES                               (0x1U << 2U)
#define    FL_CMU_GROUP2_BUSCLK_DMA                               (0x1U << 4U)
#define    FL_CMU_GROUP2_BUSCLK_FLASH                             (0x1U << 5U)
#define    FL_CMU_GROUP2_BUSCLK_RAMBIST                           (0x1U << 6U)
#define    FL_CMU_GROUP2_BUSCLK_WWDT                              (0x1U << 7U)
#define    FL_CMU_GROUP2_BUSCLK_ADC                               (0x1U << 8U)
#define    FL_CMU_GROUP2_BUSCLK_DAC                               (0x1U << 9U)
#define    FL_CMU_GROUP2_BUSCLK_OPA                               (0x1U << 10U)
#define    FL_CMU_GROUP2_BUSCLK_PGL                               (0x1U << 11U)

#define    FL_CMU_GROUP3_BUSCLK_SPI0                              (0x1U << 0U)
#define    FL_CMU_GROUP3_BUSCLK_SPI1                              (0x1U << 1U)
#define    FL_CMU_GROUP3_BUSCLK_UART0                             (0x1U << 8U)
#define    FL_CMU_GROUP3_BUSCLK_UART1                             (0x1U << 9U)
#define    FL_CMU_GROUP3_BUSCLK_UART2                             (0x1U << 10U)
#define    FL_CMU_GROUP3_BUSCLK_UART3                             (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_UART4                             (0x1U << 12U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART0                           (0x1U << 16U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART1                           (0x1U << 17U)
#define    FL_CMU_GROUP3_BUSCLK_FSCAN                             (0x1U << 19U)
#define    FL_CMU_GROUP3_BUSCLK_UARTIR                            (0x1U << 23U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB0                           (0x1U << 28U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB1                           (0x1U << 29U)

#define    FL_CMU_GROUP4_BUSCLK_GPTIM0                            (0x1U << 1U)
#define    FL_CMU_GROUP4_BUSCLK_GPTIM1                            (0x1U << 2U)
#define    FL_CMU_GROUP4_BUSCLK_ATIM                              (0x1U << 4U)
#define    FL_CMU_GROUP4_BUSCLK_BSTIM16                           (0x1U << 8U)
#define    FL_CMU_GROUP4_BUSCLK_TAU0                              (0x1U << 10U)
#define    FL_CMU_GROUP4_BUSCLK_DIVAS                             (0x1U << 11U)

#define    FL_CMU_GROUP1_OPCLKEN_EXTI                             (0x1U << 31U)
#define    FL_CMU_GROUP1_OPCLKEN_FLASH                            (0x1U << 30U)
#define    FL_CMU_GROUP1_OPCLKEN_LPUART1                          (0x1U << 29U)
#define    FL_CMU_GROUP1_OPCLKEN_LPUART0                          (0x1U << 28U)
#define    FL_CMU_GROUP1_OPCLKEN_LED                              (0x1U << 25U)
#define    FL_CMU_GROUP1_OPCLKEN_RNG                              (0x1U << 24U)
#define    FL_CMU_GROUP1_OPCLKEN_I2CSMB1                          (0x1U << 21U)
#define    FL_CMU_GROUP1_OPCLKEN_I2CSMB0                          (0x1U << 20U)
#define    FL_CMU_GROUP1_OPCLKEN_ATIM                             (0x1U << 14U)
#define    FL_CMU_GROUP1_OPCLKEN_UART3                            (0x1U << 7U)
#define    FL_CMU_GROUP1_OPCLKEN_UART2                            (0x1U << 6U)
#define    FL_CMU_GROUP1_OPCLKEN_UART1                            (0x1U << 5U)
#define    FL_CMU_GROUP1_OPCLKEN_UART0                            (0x1U << 4U)
#define    FL_CMU_GROUP1_OPCLKEN_BSTIM16                          (0x1U << 3U)
#define    FL_CMU_GROUP1_OPCLKEN_LPTIM16                          (0x1U << 1U)
#define    FL_CMU_GROUP2_OPCLKEN_FSCAN                            (0x1U << 8U)

#define    FL_CMU_APBCLK_PSC_DIV1                                (0x0U << CMU_SYSCLKCR_APBPRES_Pos)
#define    FL_CMU_APBCLK_PSC_DIV2                                (0x4U << CMU_SYSCLKCR_APBPRES_Pos)
#define    FL_CMU_APBCLK_PSC_DIV4                                (0x5U << CMU_SYSCLKCR_APBPRES_Pos)
#define    FL_CMU_APBCLK_PSC_DIV8                                (0x6U << CMU_SYSCLKCR_APBPRES_Pos)
#define    FL_CMU_APBCLK_PSC_DIV16                               (0x7U << CMU_SYSCLKCR_APBPRES_Pos)


#define    FL_CMU_AHBCLK_PSC_DIV1                                 (0x0U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV2                                 (0x4U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV4                                 (0x5U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV8                                 (0x6U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV16                                (0x7U << CMU_SYSCLKCR_AHBPRES_Pos)


#define    FL_CMU_SYSTICK_CLK_SOURCE_AHBCLK_DIV8                  (0x0U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_XTLF                         (0x1U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_RCLP                         (0x2U << CMU_SYSCLKCR_STCLKSEL_Pos)


